package com.example.user.myhealthcheck;

import android.content.Context;
import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.ImageButton;
import android.widget.TextView;

public class first_aid extends AppCompatActivity {
    TextView button, button2, button3, button4, button5, button6, button7, button8;
    TextView odhgies;
    SessionManager session;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        session = new SessionManager(getApplicationContext());
        setContentView(R.layout.activity_first_aid);
        odhgies = (TextView) findViewById(R.id.odhgies);

        button = (TextView) findViewById(R.id.anaz);
        button2 = (TextView) findViewById(R.id.karpa);
        button3 = (TextView) findViewById(R.id.asthma);
        //button4 = (TextView) findViewById(R.id.aima);
        button5 = (TextView) findViewById(R.id.pnigm);
        button6 = (TextView) findViewById(R.id.hlektro);
        button8 = (TextView) findViewById(R.id.heart);
        addListenerOnButton();
    }

    public void addListenerOnButton() {

        final Context context = this;


        // btn_login = (Button) findViewById(R.id.btn_login);
        // link_signup = (Button) findViewById(R.id.link_signup);
        button.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View arg0) {
                odhgies.setText("\uF0B7 Θέση Ασφαλείας\n" +
                        "1. Γονατίζουμε δίπλα στο θύμα, αφαιρούμε τυχόν αντικείμενα\n" +
                        "(γυαλιά, κλειδιά, κινητό) και τοποθετούμε το θύμα σε ύπτια θέση\n" +
                        "(ανάσκελα). Βεβαιωνόμαστε ότι τα πόδια του είναι σε ευθεία\n" +
                        "γραμμή. Φέρουμε τα χέρια του σε επαφή με τον κορμό.\n" +
                        "2. Στη συνέχεια τοποθετούμε το άνω άκρο του θύματος που\n" +
                        "βρίσκεται προς την πλευρά μας σε ορθή γωνία, ως προς τον\n" +
                        "κορμό του και ως προς τον αγκώνα του.\n" +
                        "3. Φέρουμε και το άλλο άνω άκρο πάνω στο στήθος με κατεύθυνση προς τον ώμο και την παλάμη προς τα κάτω\n 4. Λυγίζουμε το πόδι που βρίσκεται απέναντί του ώστε να πατήσει\n" +
                        "ολόκληρο το πέλμα του.\n" +
                        "5. Στη συνέχεια πιάνουμε το λυγισμένο γόνατο\n"+
                "6. Πλέκουμε τα δάκτυλα του χεριού μας με τα δάκτυλα του χεριού\n" +
                        "του θύματος που βρίσκεται από την ίδια μεριά που είναι το\n" +
                        "λυγισμένο γόνατο .\n" +
                        "7. Τον γυρίζουμε προς τη μεριά μας με μοχλό το λυγισμένο γόνατο.\n" +
                        "8. Φέρουμε το κεφάλι σε ελαφρά έκταση, ώστε να διατηρείται\n" +
                        "η βατότητα του αεραγωγού.\n"+
                "9. Παίρνουμε τηλέφωνο στο 166 ή στο 112 και αναφέρουμε\n" +
                        "ότι έχουμε ένα θύμα που αναπνέει αλλά δεν ανταποκρίνεται\n" +
                        "καλά.\n" +
                        "10. Σε τακτά χρονικά διαστήματα ο διασώστης ελέγχει το θύμα\n" +
                        "αν διατηρεί φυσιολογική αναπνοή.\n");
            }

        });
        button2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View arg0) {
                odhgies.setText("\uF0B7 Εάν δεν υπάρχει ανταπόκριση ξεκινάμε το πρωτόκολλο της βασικής\n" +
                        "υποστήριξης της ζωής. Την Καρδιοπνευμονική Αναζωογόνηση (ΚΑΡΠΑ) :\n" +
                        "1. Ελέγχουμε εάν ο αεραγωγός είναι ανοικτός.\n" +
                        "Στο θύμα με απώλεια συνείδησης η γλώσσα που είναι ένας βαρύς\n" +
                        "μυς και προσφύεται στην κάτω γνάθο, πέφτει προς τα πίσω\n" +
                        "λόγω της βαρύτητας και αποφράσσει τον αεραγωγό στο οπίσθιο\n" +
                        "φαρυγγικό τοίχωμα. "+
                "2. Κάνουμε ανάσπαση της κάτω γνάθου με τον δείκτη και το μέσο\n" +
                        "δάκτυλο της παλάμης μας στο οστέινο τμήμα της και μια μικρή\n" +
                        "έκταση της κεφαλής βάζοντας το άλλο μας χέρι στο μέτωπο του\n" +
                        "πάσχοντα."+
                "4. Ψάχνω για αναπνοές κανονικές.\n" +
                        "5. Κάθε άλλος παράξενος θόρυβος θεωρείται αναπνοή ανακοπής.\n" +
                        "6. Εάν δεν δούμε, δεν ακούσουμε, δεν αισθανθούμε, άμεσα :\n" +
                        "\uF0A7 Πρέπει να ειδοποιηθεί να έρθει ιατρική βοήθεια\n" +
                        "καλώντας ΕΚΑΒ-166 ή το 112 .\n" +
                        "\uF0A7 Εάν υπάρχει κάποιος κοντά μας του αναθέτουμε να\n" +
                        "τηλεφωνήσει αυτός στο ΕΚΑΒ.\n" +
                        "\uF0A7 Αλλιώς πρέπει να τηλεφωνήσουμε εμείς και εάν έχουμε\n" +
                        "την δεξιότητα μπορούμε να βάλουμε το τηλέφωνο σε\n" +
                        "ανοικτή ακρόαση ή χρησιμοποιώντας hands free ή\n" +
                        "bluetooth ξεκινώντας άμεσα θωρακικές συμπιέσεις."+
                "7. Οι θωρακικές συμπιέσεις γίνονται στην μεσότητα του θώρακα\n" +
                        "πάνω στο στέρνο:\n" +
                        "\uF0A7 Βάζουμε το ένα χέρι πάνω στο άλλο.\n" +
                        "\uF0A7 Δεν παίζει ρόλο ποιο από τα δύο χέρια βάζουμε πρώτο κάτω.\n" +
                        "\uF0A7 Πλέκουμε τα δάκτυλα των χεριών μας.\n" +
                        "\uF0A7 Βάζουμε τη βάση της παλάμης στο κέντρο του θώρακα και\n" +
                        "πιο συγκεκριμένα στο κάτω μισό του στέρνου\n" +
                        "\uF0A7 Τεντώνουμε τους αγκώνες.\n" +
                        "\uF0A7 Οι ώμοι παράλληλοι στο θύμα .\n" +
                        "\uF0A7 Ξεκινάμε συμπιέσεις, με το βάρος του σώματος μας,\n" +
                        "με ρυθμό 100 -120 min σε βάθος 5-6 cm.\n" +
                        "\uF0A7 Κάνουμε 30 θωρακικές συμπιέσεις αφήνοντας μεταξύ των\n" +
                        "συμπιέσεων ίσο χρόνο χαλάρωσης"+
                "8. Μετά ξεκινάμε την διαδικασία των δύο εμφυσήσεων.\n" +
                        "\uF0A7 Απελευθερώνουμε τον αεραγωγό.\n" +
                        "\uF0A7 Κάνουμε έκταση της κεφαλής.\n" +
                        "\uF0A7 Ανύψωση του πηγουνιού.\n" +
                        "\uF0A7 Κλείνουμε τη μύτη.\n" +
                        "\uF0A7 Παίρνουμε μια κανονική αναπνοή.\n" +
                        "\uF0A7 Σφραγίζουμε τα χείλη μας γύρω από το στόμα του θύματος.\n" +
                        "\uF0A7 Εκπνέουμε μέχρι να ανυψωθεί ο θώρακας του θύματος.\n" +
                        "\uF0A7 Η διάρκεια περίπου 1’’.\n" +
                        "\uF0A7 Απομακρύνουμε το κεφάλι μας για να κάνει εκπνοή το θύμα.\n" +
                        "\uF0A7 Αφήνουμε το θώρακα να πέσει.\n" +
                        "\uF0A7 Το επαναλαμβάνουμε για δεύτερη φορά");
            }

        });

    }
}